// use this as an input example but do not access it, the argument you take in will be the dungeon as well.
const Grimtol = [
  [], [
    ['💎', '💎'], [], [
      [], '💎', [
        [
          ['💎']
        ]
      ], ['💎', '💎'

      ], ['💎'], [['💎']], [
        ['💎',
          ['💎']
        ]
      ]
    ], '💎', '💎'
  ], [[]], [
    [
      '💎'
    ]
  ], [], '💎', [
    ['💎', [
      ['💎',
        ['💎'], [
          '💎'
        ], [
          '💎',
          [
            [], [
              ['💎', '💎'], [], [
                [], '💎', [
                  [
                    ['💎']
                  ]
                ], ['💎', '💎'

                ], ['💎'], [['💎']], [
                  ['💎',
                    ['💎']
                  ]
                ]
              ], '💎', '💎'
            ], [[]], [
              [
                '💎'
              ]
            ], [], '💎', [
              ['💎', [
                ['💎',
                  ['💎'], [
                    '💎'
                  ], [
                    '💎'
                  ]
                ], '💎', ['💎', [

                ],
                  '💎'],
              ]
              ]
            ]
          ]
        ]
      ], '💎', [
        [], [
          ['💎', '💎'], [], [
            [], '💎', [
              [
                ['💎']
              ]
            ], ['💎', '💎'

            ], ['💎'], [['💎']], [
              ['💎',
                ['💎']
              ]
            ]
          ], '💎', '💎'
        ], [[]], [
          [
            '💎'
          ]
        ], [], '💎', [
          ['💎', [
            ['💎',
              ['💎'], [
                [], [
                  ['💎', '💎'], [], [
                    [], '💎', [
                      [
                        ['💎']
                      ]
                    ], ['💎', '💎'

                    ], ['💎', ['💎', '💎'], [], [
                      [], '💎', [
                        [
                          ['💎']
                        ]
                      ], ['💎', '💎'

                      ], ['💎'], [['💎']], [
                        ['💎',
                          ['💎']
                        ]
                      ]
                    ]], [['💎']], [
                      ['💎',
                        ['💎']
                      ]
                    ]
                  ], '💎', '💎'
                ], [[], [
                  ['💎']
                ]], [
                  [
                    '💎'
                  ]
                ], [], '💎', [
                  ['💎', [
                    ['💎',
                      ['💎'], ['💎', '💎'], [], [
                        [], '💎', [
                          [
                            ['💎']
                          ]
                        ], ['💎', '💎'

                        ], ['💎',], [['💎']], [
                          ['💎',
                            ['💎']
                          ]
                        ]
                      ], [
                        '💎'
                      ], [
                        '💎'
                      ]
                    ], '💎', ['💎', [

                    ],
                      '💎'],
                  ]
                  ]
                ]
              ], [
                '💎'
              ], [
                '💎'
              ]
            ], '💎', ['💎', [

            ],
              '💎'],
          ]
          ]
        ]
      ], ['💎', [

      ],
        '💎'],
    ]
    ]
  ]
]

// -- Update the function below as needed. 
// -- Do not change the name of the function
function challenge(dungeon) {

}


// Uncomment next line to show inputs in console
// @ts-ignore
window.showInput = true

// Uncomment next line to disable Hints
// @ts-ignore
// window.disableHints = true

// Uncomment next line to show solution
// @ts-ignore
// window.showSolution = true


// -- Do not change the name of the function
//@ts-ignore
window.challenge = challenge
